MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX150F256L.atdf
      <value-group caption="Automatic Address Detect Mode Enable bit" name="U5STA__ADM_EN">
         <value caption="Automatic Address Detect mode is enabled" name="" value="0x1" />
         <value caption="Automatic Address Detect mode is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01385" name="WDT" version="2">
      <register-group name="WDT">
         <register caption="Watchdog Timer Control Register" name="WDTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Watchdog Timer Reset bit" mask="0x00000001" name="WDTCLR" values="WDTCON__WDTCLR" />
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x00000002" name="WDTWINEN" values="WDTCON__WDTWINEN" />
            <bitfield mask="0x0000007C" name="SWDTPS" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x00008000" name="ON" values="WDTCON__ON" />
         </register>
      </register-group>
      <value-group caption="Watchdog Timer Reset bit" name="WDTCON__WDTCLR">
         <value caption="Writing a 1 will clear the WDT" name="" value="0x1" />
         <value caption="Software cannot force this bit to a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="WDTCON__WDTWINEN">
         <value caption="Enable windowed Watchdog Timer" name="" value="0x1" />
         <value caption="Disable windowed Watchdog Timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="WDTCON__ON">
         <value caption="Enables the WDT if it is not enabled by the device configuration" name="" value="0x1" />
         <value caption="Disable the WDT if it was enabled in software" name="" value="0x0" />
      </value-group>
   </module>
</modules>
<pinouts/>
</avr-tools-device-file>

